OpenFOAM/OpenFOAM-2.2.x/tutorials/mesh/snappyHexMesh/snappyMultiRegionHeater/system/README
fvSolution is used for outer correctors specification.
fvSchemes is only so that pre-processing activities can proceed

